import { Faq } from '~/types/Faq';

export const FAQ: Faq[] = [
  {
    id: 1,
    question: 'Коли цвітуть німфеї?',
    answer:
      "Період цвітіння німфей триває з кінця весни до початку осені. Залежно від сорту, перші бутони можуть з'явитися вже в травні, а їхнє яскраве цвітіння триватиме до вересня.",
  },
  {
    id: 2,
    question: 'Коли і як краще садити?',
    answer:
      'Оптимальний час для посадки водяних лілій - з травня по серпень, коли температура води стабільно тримається на рівні 15°C і вище. Рослини висаджують у спеціальні контейнери або безпосередньо в дно водойми. Глибина посадки залежить від сорту: карликові види вимагають 15-30 см води, а великі можуть рости на глибині до 1,5 м.',
  },
  {
    id: 3,
    question: 'Як доглядати за квітами?',
    answer:
      'Німфеї невибагливі, але вимагають мінімального догляду:\n  - Видаляйте відцвілі бутони і старе листя.\n  - Забезпечте рослинам достатнє освітлення, вони люблять сонячні місця.\n  - Регулярно підгодовуйте лілії добривами для водних рослин.',
  },
  {
    id: 4,
    question: 'Як зберегти німфею зимою?',
    answer:
      'Всі наші сорти зимостійкі і можуть залишатися в ставку, якщо глибина водойми дозволяє кореневищам перебувати нижче рівня промерзання (зазвичай це глибина від 50 см і більше). У таких випадках лілії просто занурюються в сплячку і відновлюють ріст навесні.',
  },
  {
    id: 5,
    question: 'Скільки живуть рослини?',
    answer:
      'Корневища водяних лілій - багаторічні, і з кожним роком вони стають міцнішими і сильнішими. Для продовження життя рослин рекомендується періодично розділяти і пересаджувати кореневища, щоб уникнути їх перенаселення і виснаження, зазвичай це роблять кожні 3-5 років.',
  },
];
